Tekla.Structures.CatalogInternal.dotcatProfileItem_t
Serialization structure for ProfileItem.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.ProfileName
The name of the profile.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.Type
Whether it is a parametric profile or library profile.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.ProfileItemType
The profile item type.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.ProfileItemSubType
The profile item subtype.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.ParametricProfileDefinitionType
The profile item subtype.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.aParameterString
The parameter string of the profile.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.nProfileItemParameters
Number of profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.aProfileItemParameters
Profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.nProfileItemAnalysisParameters
Number of profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.aProfileItemAnalysisParameters
Profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.nProfileItemUserParameters
Number of profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.aProfileItemUserParameters
Profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.ProfileTreePath
Profile item tree path separated with slash'\'.

Tekla.Structures.CatalogInternal.dotcatProfileItem_t.NumberOfCrossSections
Number of cross sections in profile item.